Repository: audaciouscode/Roxy-Proxy
Catalog: django/locale/*/LC_MESSAGES/django.po
Languages: he

source: About Roxy | Roxy Proxy
he: ניתוק | רוקסי פרוקסי

source: <h1>Roxy: Enabling observational web research</h1> <h2>About Roxy</h2> <p>Roxy was created so that researchers who want to understand real-world web use could have a data-gathering tool that fully respects the privacy of research participants and provides a fully informed consent process. With Roxy, research participants have full control over their data, determining what will be captured and, after it is captured, what data will be retained. Roxy is extremely easy to use. After the brief setup process, interacting with Roxy involves just one click to indicate privacy settings at an interval of the research participant's choice.</p> <h2>Roxy Technology</h2> <p>Roxy can gather more data from more devices than other data collection systems. Roxy is a proxy server. It is more like the code that runs Facebook than it is like a program on your computer like Microsoft Word. Because it does not need to be installed on participants' computers it can work with any operating system, Windows, Mac, Linux, and mobile or tablet operating systems (most mobile networks do not allow proxies, however). Users simply configure their web browser to connect to Roxy. Roxy can collect the content of the web pages as they are retrieved by participants. This is particularly important in the ever-changing web environment.</p> <p>Roxy began as a tool to collect data for <A href="http://www.ericka.cc/">Ericka Menchen-Trevino's</a> dissertation, with development by <a href="http://www.audacious-software.com">Audacious Software</a>. Roxy was named as a blend of the words research and proxy.</p>
he: <h1>רוקסי: מאפשר מחקר תצפיתי באינטרנט</h1><h2>על רוקסי</h2><p>רוקסי נוצרה על מנת לאפשר לחוקרים שרוצים להבין התנהגות ברשת לאסוף מידע בדרך שתשמור על פרטיות המשתתפים במחקר ותאפשר למשתתפים לתת הסכמה מלאה מדעת. כאשר משתמשים ברוקסי למשתתפים יש שליטה מלאה על הנתונים שנאספים - הם קובעים מה יתועד ומה ישמר. רוקסי קלה לשימוש. אחרי תהליך התקנה קצר, מעבר למצב "פרטי" דורש רק קליק אחד בהתאם לבחירת המשתמש. </p><h2>הטכנולוגיה של רוקסי</h2><p>רוקסי יכולה לאסוף מידע מיותר מכשירים בהשוואה לכל מערכת ניטור מידע אחרת. רוקסי היא שרת פרוקסי. היא דומה יותר לקוד התוכנה מאחורי פייסבוק מאשר לתוכנות כמו אקסל או וורד. בגלל שהיא לא מותקנת על המחשב של המשתמש היא יכולה לעבוד עם כל מערכת הפעלה, ווינדוס, מק, לינוקס, טלפונים חכמים וטאבלטים (חשוב לציין כי רוב הרשתות הסלולריות כמו אורנג' וסלקום לא מאפשרות שימוש בשרת פרוקסי ולכן אי אפשר להשתמש ברוקסי באינטרנט סלולרי). המשתמשים פשוט מגדרים לדפדפן להתחבר לרוקסי. רוקסי מתעדת את הדפים אליהם נכנסים המשתמשים כאשר הם נכנסים אליהם. זה חשוב במיוחד מכיוון שהאינטרנט נתון לשינוי בלתי נפסק.</p><p>רוקסי החלה ככלי לאיסוף נתונים עבור עבודת התזה של<A href="http://www.ericka.cc/">Ericka Menchen-Trevino's</a>ופותחה יחד כם<a href="http://www.audacious-software.com">Audacious Software</a>השם הוא שילוב של המילים research / proxy</p>

source: Blacklist Domain | Roxy Proxy
he: ניתוק | רוקסי פרוקסי

source: Roxy Blacklist
he: הרשימה החסומה שלך ברוקסי

source: Adding a website to your blacklist will prevent future logging of this site (starting about 60 seconds after you add it), and will prompt Roxy to delete any previous content from this site from your records within 24 hours.
he: הוספה של אתר לרשימה החסומה שלך ברוקסי ימנע מרוקסי לתעד כל מידע עתידי מאתר זה (החל מ 60 שניות לאחר הכנסת האתר לרשימה החסומה) ובנוסף ימחק כל תיעוד קודם של מידע מאתר זה, תוך 24 שעות

source: Enter a domain into the form below. A domain is simply the part of the website before .com, .org, .net etc. The domain of the url http://www.chase.com/home.php is simply <code>chase.com</code>. This will blacklist all content from <code>chase.com</code> after about <strong>60 seconds</strong>.
he: הכנס את הדומיין אל הטופס מתחת. דומיין הוא פשוט החלק בשם האתר שבא לפני הסיומת שלו .com ,org .net .co.il וכו'. הדומיין של הקישור http://www.chase.com/home.php הוא פשוט <code>chase.com</code>. זה יחסום כל תוכן מ <code>chase.com</code> אחרי בערך <strong>60 שניות</strong>.

source: %(domain)s added to your personal blacklist.
he: %(domain)s נוסף לרשימת האתרים החסומים שלך

source: Submit
he: חסום

source: Your Blacklisted Domains
he: הרשימה החסומה שלך

source: No domains blacklisted yet...
he: לא נחסמו עדיין אתרים

source: <h1>Frequently Asked Questions</h1> <h3>What does Roxy log?</h3> <p>You have complete control over what Roxy logs. If you choose a "private" session nothing is logged. You can also specify websites you do not want Roxy to log. If you choose a "regular" session, Roxy only logs insecure web pages (those that start with http rather than https). All bank sites and online shopping carts are secure and use https when you login. Many other sites also use https, such as Facebook most Google websites, and most web-based email.</p> <h3>How do I know what Roxy has logged?</h3> <p>You can see the pages Roxy has logged. Just login to Roxy and go to the <a href="
he: <h1>תשובות לשאלות נפוצות</h1><h3>איזה מידע רוקסי מתעדת על הגלישה שלי</h3><p>יש לך שליטה מלאה לגבי המידע שרוקסי מתעדת. אם תבחר להשתמש במצב "פרטיות" שום דבר לא יתועד. אתה גם יכול להגדיר אתרים מסוימים שאותם רוקסי לא תתעד אף פעם. באופן אוטומטי, גם בגלישה במצב "רגיל" רוקסי לא מתעדת נתונים מאתרים מאובטחים (אלה הם אתרים שהכותבת שלהם מתחילה ב https). כל אתרי הבנקים ואתרי הקניה המקוונת הם אתרים מאובטחים לכן רוקסי לא יכולה לתעד מהם מידע. יש הרבה מאד אתרים אחרים שהנם מאובטחים כמי פייסבוק, רוב החלקים של גוגל ורוב שרתי האימיילים. מכל האתרים הללו לא יתועדו נתונים.</p><h3> איך אני יודע מה רוקסי תעדה?</h3><p>אתה יכול לראות את העמודים שרוקסי תיעדה. פשוט התחבר ולך ל <a href="

source: ">My Home</a> page.</p> <h3>How do I blacklist or delete websites that Roxy has logged?</h3> <p>Just go to the Blacklist link in Roxy, enter the domain that you'd like to blacklist and Roxy will not gather further information from this site and will delete any previous content from the site it has stored.</p> <h3>Is my data secure?</h3> <p>Yes, Roxy uses all of the standard security measures for web applications. The beta testing data will be deleted when testing is completed.</p> <h3>I use a Mac or Linux computer. Can I use Roxy?</h3> <p>Yes, Roxy is web-based so if you connect to the web in most cases you can use Roxy.</p> <h3>Does Roxy log anything on my computer except for web pages?</h3> <p>No, Roxy only logs web pages. Roxy doesn't have any access to your computer; it is a program you logon to online.</p> <h3>How does Roxy work?</h3> <p>Roxy is a proxy server that you login to on the web. It runs on a server like other web-based applications like Facebook. When the research project is over and you take out Roxy's PAC file setting your computer remains unchanged by Roxy.</p> <h3>Why was Roxy developed?</h3> <p>Roxy was created because Internet researchers did not have a flexible and ethical way to gather web browsing data from research participants on a variety of computer platforms. Research ethics demand informed consent so Roxy was designed with transparency, privacy and user control as its primary goals.</p>
he: ">האזור שלי</a>.</p><h3>איך אוכל לחסום (blacklist) או למחוק אתרים שרוקסי תיעדה</h3><p>פשוט לך לינק חסום ברוקסי, הכנס את שם הדומיין שאתה רוצה לחסום ורוקסי לא תתעד יותר מידע מאתר זה וגם תמחוק כל מידע קודם שתועד על אתר זה</p><h3>האם המידע שלי מאובטח</h3><p>כן! רוקסי משתמשת בכל אמצעי ההבטחה הסטנדרטיים של אתרים ברשת. נתוני הבטא ימחקו ברגע שתסתיים תקופת ההרצה</p><h3>אני משתמש במק / בלינוקס. האם אני יכול להשתמש ברוקסי?</h3><p>כן רוקסי היא מבוססת רשת. אם אתה יכול להתחבר לאינטרנט ברוב המקרים אתה יכול להשתמש ברוקסי</p><h3>האם רוקסי מתעדת משהו מהמחשב שלי חוץ מדפוסי הגלישה שלי?</h3><p>לא! רוקסי מתעדת רק גלישה. אין לרוקסי גישה למחשב שלך, היא תוכנה שמתחברים אליה רק אונליין</p><h3>איך רוקסי עובדת?</h3><p>רוקסי היא תוכנת פרוקסי (proxy) שאתה מתחבר אליה ברשת. היא רצה על שרת כמו תוכנות מבוססות רשת אחרות דוגמת פייסבוק. כאשר המחקר יגמר ותמחק את ההגדרות של רוקסי מהמחשב שלך, המחשב יישאר כפי שהיה לפני שהתקנת את רוקסי</p><h3>למה פיתחתם את רוקסי?</h3><p>רוקסי פותחה כי מחקר רשת לא הציע דרך גמישה ואתית לאסוף מידע על גלישה מאנשים המשתתפים במחקרי אינטרנט. האתיקה המחקרית דורשת הסכמה מלאה לכן רוקסי פותחה כשמטרתה היא שקיפות מלאה, פרטיות, ושליטה של המשתמש</p>

source: Roxy Proxy
he: רוקסי פרוקסי

source: Roxy Testing and Development
he: רוקסי פיתוח תוכנה

source: Thank you for helping to test Roxy as we develop this new version.
he: תודה לכם על עזרתכם בפיתוח הגרסה החדשה של רוקסי.

source: <strong>///</strong></span> Getting Started
he: \\\</span> מתחילים

source: First
he: תחילה

source: register for an account</a>, login, then follow the
he: פתח חשבון</a>, התחבר ואז עקוב אחרי

source: setup instructions for your browser</a>. You're all set if you
he: הוראות ההפעלה לדפדפן שלך</a>. אתה מוכן להתחיל אם אתה

source: click here</a> and Roxy is active.
he: לוחץ כאן</a> ורוקסי פעילה

source: You may want to bookmark the
he: מומלץ להוסיף למועדפים את העמוד

source: Change Session Type</a> page for easy access to control your session type.
he: שנה מצב גלישה</a> על מנת להקל את השליטה על מצב הגלישה שלך

source: <strong>///</strong></span> Beta Testing
he: \\\</span> הרצת נסיון

source: <p>If your internet connection seems slow or if anything weird starts happening with your Internet connection, try taking out the Roxy proxy setting to see if that solves your problem. If so, please report the problem ASAP using the form below or by emailing Ericka &#101;&#114;&#105;&#099;&#107;&#097;&#064;&#114;&#111;&#120;&#121;&#112;&#114;&#111;&#120;&#121;&#046;&#111;&#114;&#103;. It helps to know the time when a problem occurred.</p>
he: <p>אם חיבור האינטרנט שלכם איטי או שדברים מוזרים מתחילים לקרות לחיבור האינטרנט שלכם, נסו לבטל את ההגדרות של רוקסי פרוקסי ולראות עם זה עוזר. אם ביטול רוקסי פותר את הבעיה, אנא דווחו בדחיפות על הבעיה לאריקה במייל למטה &#101;&#114;&#105;&#099;&#107;&#097;&#064;&#114;&#111;&#120;&#121;&#112;&#114;&#111;&#120;&#121;&#046;&#111;&#114;&#103;זה יעזור לנו אם נדע מתי הבעיה ארעה</p>

source: <span class="colored">///<strong></strong></span> Thank You!
he: <span class="colored">\\\</span> תודה רבה

source: <span class="colored">///</span> Report a bug or ask a question
he: <span class="colored">\\\</span> דווח על תקלה או שאל שאלה

source: Name
he: שם

source: Please include your operating system version, browser version, Roxy user name, and the time when the issue occurred.
he: אנא כתוב לנו באיזו גרסה של מערכת הפעלה את מתשמש, מה הדפדפן שלך, מה שם המתשמש שלך ברוקסי ואת השעה בה קרתה התקלה

source: Send Message
he: שלח הודעה

source: <!DOCTYPE html><html lang="en">
he: <!DOCTYPE html><html lang="he" dir="rtl">

source: Roxy Proxy Setup
he: התקנה של רוקסי פרוקסי

source: Roxy must be setup for each web browser you use. Choose your operating system and web browser:
he: אתה צריך להתקין את רוקסי לכל דפדפן בו אתה משתמש, במידה ואתה משתמש ביותר מדפדפן אחד. אנא בחר את מערכת ההפעלה שלך ואת הדפדפן שלך:

source: Apple Products
he: מוצרים של אפל

source: Macintosh Setup: Safari, Chrome or Firefox
he: התקנה למק: ספארי, כרום, פיירפוקס

source: iPhone
he: אייפון

source: iPad
he: אייפד

source: Microsoft Windows
he: ווינדוס של מיקרוסופט

source: Internet Explorer
he: אקפלורר

source: Firefox
he: פיירפוקס

source: Google Chrome
he: גוגל כרום

source: Other Products
he: מוצרים אחרים

source: Linux Firefox
he: פיירפוקס ללינוקס

source: Other computers or devices that connect to the web
he: מחשבים או מוצרים אחרים שמתחברים לרשת

source: History
he: היסטוריה

source: Blacklist
he: רשימת אתרים חסומים

source: Change Password
he: שנה סיסמה

source: Change Session Type
he: שנה סוג גלישה

source: Edit Profile
he: ערוך פרופיל

source: Roxy Setup Test
he: בחינת התקנת פרוקסי

source: Getting Started
he: מתחילים

source: Using Roxy
he: השימוש ברוקסי

source: Frequently Asked Questions
he: שאלות נפוצות

source: About Roxy
he: קצת על רוקסי

source: <span class="colored">///</span> Roxy
he: <span class="colored">\\\</span> רוקסי

source: Roxy is designed to enable observational web research with fully informed consent.
he: רוקסי נועדה לאפשר מחקר אקדמי על הרגלי גלישה באינטרנט עם הסכמה מלאה של המשתתפים

source: ///</span> Contact info
he: \\\</span> צור קשר

source: Email:
he: אימייל

source: Phone:
he: טלפון

source: Beta Testing Home
he: דף ראשי הרצת בטא

source: About
he: עלינו

source: FAQ
he: שאלות נפוצות

source: My Home
he: האזור שלי

source: Logout
he: התנתק

source: Register
he: הרשם

source: Login
he: התחבר
